# RelinquishUserCreatedWorksets Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions..::..RelinquishUserCreatedWorksets Property
SynchronizeWithCentralOptions Class See Also
---
Indicates whether Revit should relinquish user-created Standard worksets after synchronizing with central.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool RelinquishUserCreatedWorksets { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RelinquishUserCreatedWorksets As Boolean
	Get
```

Visual C++
---
```text
public:
property bool RelinquishUserCreatedWorksets {
	bool get ();
}
```

# Remarks
This is a shortcut to access the value stored in UserWorksets.
# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace